technic = [('Ноутбук', 1500, 'Татьяна', '89002001020'),
    ('Смартфон', 500, 'Анна', '89202202325'),
    ('Проектор ', 300, 'Андрей', '89505205656'),
    ('ПрИнтер', 750, 'Игорь', '89303303236'),
    ('Планшет', 200, 'Игорь', '89303303236'),
    ('Смартфон', 1000, 'Андрей', '89505205656'),
    ('Ноутбук', 4800, 'Татьяна', '89002001020'),
    ('Наушники', 780, 'Марина', '89562002350'),
    ('Сканер', 550, 'Сергей', '89808564559'),
    ('Планшет', 1200, 'Анна', '89202202325'),
    ('Ноутбук', 1100, 'Игорь', '89303303236'),
    ('Смартфон', 3500, 'Татьяна', '89002001020')
]


def get_inline_db(database: list[tuple]) -> dict:
    inline_db = {}
    for obj in database:
        if inline_db.get(f'{obj[2]} {obj[3]}'):
            inline_db[f'{obj[2]} {obj[3]}'] += f'; {obj[0]} - {obj[1]}'
        else:
            inline_db[f'{obj[2]} {obj[3]}'] = f'{obj[0]} - {obj[1]}'

    return inline_db
